emacs-config.org
#+TITLE: Emacs Configuration
#+PROPERTY: header-args:emacs-lisp :tangle ./.emacs.d/init.el :mkdirp yes

* Base Configuration

Just the basics.

#+begin_src emacs-lisp

  ;; ===== BASE CONFIG =====

#+end_src

#+begin_src emacs-lisp

  ;; Disable backup files
  (setq make-backup-files nil)

  ;; Disable lock files
  (setq create-lockfiles nil)
   
  ;; Put auto-save files in a central location
  (make-directory (expand-file-name "tmp/auto-saves/" user-emacs-directory) t)
  (setq auto-save-file-name-transforms `((".*" ,(expand-file-name "tmp/auto-saves/" user-emacs-directory) t)))

  ;; Keep customization settings out of init.el
  (setq custom-file (locate-user-emacs-file "custom.el"))
  (when (file-exists-p custom-file)
    (load custom-file 'noerror 'nomessage))

  ;; Save command history between sessions
  (setq history-length 25)
  (savehist-mode 1)

  ;; Update buffers when underlying file has changed
  (global-auto-revert-mode 1)

  ;; Update non-file-visiting buffers when the underlying changes happen, such as Dired buffers
  (setq global-auto-revert-non-file-buffers t)

#+end_src

* Package System Configuration

Setup use-package.

#+begin_src emacs-lisp

  ;; ===== PACKAGE SYSTEM =====

#+end_src

#+begin_src emacs-lisp

  ;; Initialize package sources
  (require 'package)

  (setq package-archives '(("melpa" . "https://melpa.org/packages/")
  			 ("nongnu" . "https://elpa.nongnu.org/nongnu/")
  			 ("elpa" . "https://elpa.gnu.org/packages/")))

  (package-initialize)

  (require 'use-package)
  (setq use-package-always-ensure t)

#+end_src

** Automatic Package Updates

Keep packages up to date automatically, prompting every 30 days.

#+begin_src emacs-lisp

  (use-package auto-package-update
    :custom
    (auto-package-update-interval 30)
    (auto-package-update-prompt-before-update t)
    (auto-package-update-hide-results t)
    :config
    (auto-package-update-maybe))

#+end_src

* Keybinding Configuration

Setup some spacemacs-y evil keybindings.

#+begin_src emacs-lisp

  ;; ===== KEYBINDINGS =====

#+end_src

#+begin_src emacs-lisp

  ;; Key-binding to open init.el
  (global-set-key (kbd "C-c e") (lambda () (interactive) (find-file "~/.emacs.d/init.el")))

  ;; Key-binding to make ESC quit prompts
  (global-set-key (kbd "<escape>") 'keyboard-escape-quit)

  (use-package evil
    :init
    (setq evil-want-integration t)
    (setq evil-want-keybinding nil)
    (setq evil-want-C-u-scroll t)
    (setq evil-want-C-i-jump nil)
    (setq evil-undo-system 'undo-redo)
    :config
    (evil-mode 1)

    ;; Use C-g to exit insert mode
    (define-key evil-insert-state-map (kbd "C-g") 'evil-normal-state)

    ;; Use C-h as backspace in insert mode
    (define-key evil-insert-state-map (kbd "C-h") 'evil-delete-backward-char-and-join)

    ;; Add C-w u/U for winner-undo/redo
    (define-key evil-window-map (kbd "u") 'winner-undo)
    (define-key evil-window-map (kbd "U") 'winner-redo)

    ;; Use visual line motions even outside of visual-line-mode buffers
    (evil-global-set-key 'motion "j" 'evil-next-visual-line)
    (evil-global-set-key 'motion "k" 'evil-previous-visual-line)

    ;; Set default mode of certain buffer types to normal
    (evil-set-initial-state 'messages-buffer-mode 'normal)
    (evil-set-initial-state 'dashboard-mode 'normal))

  (use-package evil-collection
    :after evil
    :config
    (evil-collection-init))

  ;; TODO add "s" to lal/leader-keys for save-buffer?
  (use-package general
    :after evil
    :config
    (general-create-definer lal/leader-keys
      :keymaps '(normal insert visual emacs)
      :prefix "SPC"
      :global-prefix "C-SPC")

    (lal/leader-keys
      "t"  '(:ignore t :which-key "toggles")
      "tt" '(counsel-load-theme :which-key "choose theme")
      "b"  '(:ignore t :which-key "buffers")
      "bb" '(counsel-switch-buffer :which-key "switch buffer")
      "bd" '(kill-current-buffer :which-key "delete buffer")
      "bk" '(kill-buffer :which-key "kill buffer (select)")
      "bn" '(next-buffer :which-key "next buffer")
      "bp" '(previous-buffer :which-key "previous buffer")
      "bm" '((lambda () (interactive) (switch-to-buffer "*Messages*")) :which-key "messages buffer")
      "w"  '(:ignore t :which-key "windows")
      "wl" '(evil-window-right :which-key "window right")
      "wh" '(evil-window-left :which-key "window left")
      "wj" '(evil-window-down :which-key "window down")
      "wk" '(evil-window-up :which-key "window up")
      "ws" '(evil-window-split :which-key "split horizontal")
      "wv" '(evil-window-vsplit :which-key "split vertial")
      "wd" '(evil-window-delete :which-key "delete window")))

#+end_src

* UI Configuration

Make it pretty.

#+begin_src emacs-lisp

  ;; ===== UI =====

#+end_src

** Basic

Make it minimalist.

#+begin_src emacs-lisp

  (setq inhibit-startup-message t)    ; Don't show startup screen

  (scroll-bar-mode -1)      ; Disable visible scrollbar
  (tool-bar-mode -1)        ; Disable the toolbar
  (tooltip-mode -1)         ; Disable tooltips
  (set-fringe-mode 10)      ; Give some breathing room

  (menu-bar-mode -1)        ; Disable the menu bar

  (desktop-save-mode 1)     ; Auto-save and restore sessions

  (setq use-dialog-box nil) ; Don't show dialog box prompts

  ;; Display line numbers
  (column-number-mode)
  (global-display-line-numbers-mode t)

  ;; Don't display line numbers for some modes
  (dolist (mode '(org-mode-hook
  		term-mode-hook
  		treemacs-mode-hook
  		shell-mode-hook
  		eshell-mode-hook))
    (add-hook mode (lambda () (display-line-numbers-mode 0))))

#+end_src

** Font Configuration

Use a nice monospace font.

#+begin_src emacs-lisp

  ;; Font face and size
  (set-face-attribute 'default nil :font "Fira Code Retina" :height 150)

#+end_src

** Theme

#+begin_src emacs-lisp

  (use-package doom-themes
    :init (load-theme 'doom-city-lights t))

#+end_src

*** TODO try modus-themes

** Better Modeline

Improve the modeline, adding nice icons.  Requires running =M-x nerd-icons-install-fonts= to get the icons.

#+begin_src emacs-lisp

  (use-package nerd-icons)

  (use-package doom-modeline
    :init (doom-modeline-mode 1)
    :custom (doom-modeline-height 30))

#+end_src

** Which Key

Adds the nice mini-buffer help displaying all possible completions for a give keybinding.

#+begin_src emacs-lisp
    
  (use-package which-key
    :init (which-key-mode)
    :diminish which-key-mode
    :config
    (setq which-key-idle-delay 0.3))

#+end_src

** Ivy and Counsel

Adds a completion framework, like helm.  Counsel makes ivy better with custom versions of emacs commands like ~counsel-find-file~. Ivy-rich gives nice descriptions of the commands in the completion buffer.

#+begin_src emacs-lisp

  (use-package ivy
    :diminish
    :bind (("C-s" . swiper)
    	 :map ivy-minibuffer-map
    	 ("TAB" . ivy-alt-done)
    	 ("C-l" . ivy-alt-done)
    	 ("C-j" . ivy-next-line)
    	 ("C-k" . ivy-previous-line)
    	 :map ivy-switch-buffer-map
    	 ("C-k" . ivy-previous-line)
    	 ("C-l" . ivy-done)
    	 ("C-d" . ivy-switch-buffer-kill)
    	 :map ivy-reverse-i-search-map
    	 ("C-k" . ivy-previous-line)
    	 ("C-d" . ivy-reverse-i-search-kill))
    :config
    (ivy-mode 1))

  (use-package ivy-rich
    :after ivy
    :init
    (ivy-rich-mode 1))

  (use-package counsel
    :bind (("M-x" . counsel-M-x)
    	 ("C-x b" . counsel-switch-buffer)
    	 ("C-x C-f" . counsel-find-file)
    	 :map minibuffer-local-map
    	 ("C-r" . 'counsel-minibuffer-history))
    :config
    (counsel-mode 1))

#+end_src

** Better candidate sorting and filtering

prescient.el improves sorting and filtering of candidate lists, like those displayed in the mini-buffer with =M-x= or =C-x C-f=.  Recently used items will be put at the beginning of the list, and filtering can be done by typing the first letters of each segment of a candidate, such as =cff= for =counsel-find-file=.

#+begin_src emacs-lisp

  (use-package ivy-prescient
    :after counsel
    :config
    (ivy-prescient-mode 1)
    (prescient-persist-mode 1))

#+end_src

** Helpful

Enhances the help buffers displayed by =describe-= commands.

#+begin_src emacs-lisp

  (use-package helpful
    :custom
    (counsel-describe-function-function #'helpful-callable)
    (counsel-describe-variable-function #'helpful-variable)
    :bind
    ([remap describe-function] . counsel-describe-function)
    ([remap describe-command] . helpful-command)
    ([remap describe-variable] . counsel-describe-variable)
    ([remap describe-key] . helpful-key))

#+end_src

** Text Zoom

Add transient keybinding, using hydra, for scaling the text size up and down.

#+begin_src emacs-lisp

  (use-package hydra)

  (defhydra hydra-text-zoom (:timeout 4)
    "zoom text"
    ("j" text-scale-increase "in")
    ("k" text-scale-decrease "out")
    ("f" nil "finished" :exit t))

  (lal/leader-keys
    "ts" '(hydra-text-zoom/body :which-key "zoom text"))

#+end_src

* Org Mode

Org-mode is incredible. I should really use it more.

#+begin_src emacs-lisp

  ;; ===== ORG MODE =====

#+end_src

