emacs-config.org
** Font Faces

Fiddle with the font sizes of the bullet point hierarchy.

#+begin_src emacs-lisp

  (defun lal/org-font-setup ()
    ;; Set faces for org-mode heading levels
    (dolist (face '((org-level-1 . 1.2)
                    (org-level-2 . 1.1)
                    (org-level-3 . 1.05)
                    (org-level-4 . 1.0)
                    (org-level-5 . 1.1)
                    (org-level-6 . 1.1)
                    (org-level-7 . 1.1)
                    (org-level-8 . 1.1)))
      (set-face-attribute (car face) nil :font "Fira Code Retina" :weight 'regular :height (cdr face))))

#+end_src

** Basic

All kinds of org-mode setup:

- basic installation and setup and keybindings
- update TODO flow
- refile targets
- tag shortcuts
- custom org-agenda commands
- and capture templates for quick keybindings to capture certain things, like todos.

#+begin_src emacs-lisp

  (defun lal/org-mode-setup ()
    (org-indent-mode)
    (visual-line-mode 1))

  (use-package org
    :hook (org-mode . lal/org-mode-setup)
    :bind (("C-c a" . org-agenda)
  	 ("C-c c" . org-capture))
    :config
    (setq org-ellipsis " ▾")

    (setq org-agenda-start-with-log-mode t)
    (setq org-log-done 'time)
    (setq org-log-into-drawer t)

    (require 'org-habit)
    (add-to-list 'org-modules 'org-habit)
    (setq org-habit-graph-column 60)
    
    (setq org-agenda-files
  	'("~/code/me/org-mode-practice/tasks.org"
  	  "~/code/me/org-mode-practice/birthdays.org"
  	  "~/code/me/org-mode-practice/habits.org"))

    (setq org-todo-keywords
  	'((sequence "TODO(t)" "NEXT(n)" "|" "DONE(d!)")))

    (setq org-refile-targets
  	'(("archive.org" :maxlevel . 1)
  	  ("tasks.org" :maxlevel . 1)))

    ;; Save org buffers after a refile
    (advice-add 'org-refile :after 'org-save-all-org-buffers)

    (setq org-tag-alist
  	'((:startgroup)
  	  ;;Put mutually exclusive tags here
  	  (:endgroup)
  	  ("@errand" . ?E)
  	  ("@home" . ?H)
  	  ("@work" . ?W)
  	  ("agenda" . ?a)
  	  ("note" . ?n)
  	  ("idea" . ?i)))

    (setq org-agenda-custom-commands
  	'(("d" "Dashboard"
  	   ((agenda "" ((org-deadline-warning-days 7)))
  	    (todo "NEXT"
  		  ((org-agenda-overriding-header "Next Tasks")))
  	    (tags-todo "agenda/ACTIVE" ((org-agenda-overriding-header "Active Projects")))))

  	  ("n" "Next Tasks"
  	   ((todo "NEXT"
  		  ((org-agenda-overriding-header "Next Tasks")))))

  	  ("W" "Work Tasks" tags-todo "+work")

  	  ;; Low-effort next actions
  	  ("e" tags-todo "+TODO=\"NEXT\"+Effort<15&+Effort>0"
  	   ((org-agenda-overriding-header "Low Effort Tasks")
  	    (org-agenda-max-todos 20)
  	    (org-agenda-files org-agenda-files)))))

    (setq org-capture-templates
  	`(("t" "Tasks / Projects")
  	  ("tt" "Task" entry (file+olp "~/code/me/org-mode-practice/tasks.org" "Inbox")
  	   "* TODO %?\n  %U\n  %a\n  %i" :empty-lines 1)
  	  ("ts" "Clocked Entry Subtask" entry (clock)
  	   "* TODO %?\n  %U\n  %a\n  %i" :empty-lines 1)

  	  ("j" "Journal Entries")
  	  ("jj" "Journal" entry
  	   (file+olp+datetree "~/code/me/org-mode-practice/journal.org")
  	   "\n* %<%I:%M %p> - Journal :journal:\n\n%?\n\n"
  	   :clock-in :clock-resume
  	   :empty-lines 1)
  	  ("jm" "Meeting" entry
  	   (file+olp+datetree "~/code/me/org-mode-practice/journal.org")
  	   "* %<%I:%M %p> - %a :meetings:\n\n%?\n\n"
  	   :clock-in :clock-resume
  	   :empty-lines 1)

  	  ("w" "Workflows")
  	  ("we" "Checking Email" entry
  	   (file+olp+datetree "~/code/me/org-mode-practice/journal.org")
  	   "* Checking Email :email:\n\n%?"
  	   :clock-in :clock-resume
  	   :empty-lines 1)

  	  ("m" "Metrics Capture")
  	  ("mw" "Weight" table-line
  	   (file+headline "~/code/me/org-mode-practice/metrics.org" "Weight")
  	   "| %U | %^{Weight} | %^{Notes} |"
  	   :kill-buffer t)))
    
    (define-key global-map (kbd "C-c j")
  	      (lambda () (interactive (org-capture nil "jj"))))

    (lal/org-font-setup))

#+end_src

*** Bullets

Change the icons used for the bullets.

#+begin_src emacs-lisp

  (use-package org-bullets
    :hook (org-mode . org-bullets-mode)
    :custom
    (org-bullets-bullet-list '("◉" "○" "●" "○" "●" "○" "●")))

#+end_src

** Configure Babel Languages

Add the ability to execute code for specific languages from org files.  Load after org-mode is loaded using =with-eval-after-load=.

#+begin_src emacs-lisp

  (with-eval-after-load 'org
    (org-babel-do-load-languages
     'org-babel-load-languages
     '((shell . t )
       (emacs-lisp . t)
       (python . t)
       (js . t))))

#+end_src

** Structure Templates

Add shortcuts for adding code snippets for specific languages to org files.  Load after org-mode is loaded using =with-eval-after-load=.

#+begin_src emacs-lisp

  (with-eval-after-load 'org
    (require 'org-tempo)
    (add-to-list 'org-structure-template-alist '("sh" . "src shell"))
    (add-to-list 'org-structure-template-alist '("el" . "src emacs-lisp"))
    (add-to-list 'org-structure-template-alist '("js" . "src js"))
    (add-to-list 'org-structure-template-alist '("py" . "src python")))

#+end_src

** Auto-tangle Configuration Files

Automatically generate init.el, from the snippets in this file, anytime this file is saved.

#+begin_src emacs-lisp

  ;; Automatically tangle our Emacs.org config file when we save it
  (defun lal/org-babel-tangle-config ()
    (when (string-equal (buffer-file-name)
                        (expand-file-name "~/code/me/dotfiles/emacs-config.org"))
      ;; Dynamic scoping to the rescue
      (let ((org-confirm-babel-evaluate nil))
        (org-babel-tangle))))
  
  (add-hook 'org-mode-hook (lambda () (add-hook 'after-save-hook #'lal/org-babel-tangle-config)))

#+end_src

* Development

#+begin_src emacs-lisp

  ;; ===== DEVELOPMENT =====

#+end_src

** Languages

*** LSP Features

**** lsp-mode

Install lsp-mode to get language server protocol integration.

#+begin_src emacs-lisp

  (use-package lsp-mode
    :commands (lsp lsp-deferred)
    :init
    (setq lsp-keymap-prefix "C-c l")
    :config
    (lsp-enable-which-key-integration t))

#+end_src

***** TODO Switch to eglot?

**** lsp-ui

Adds UI enhancements for lsp-mode, like displaying symbols information and code actions in the sideline.

#+begin_src emacs-lisp

  (use-package lsp-ui
    :hook (lsp-mode . lsp-ui-mode)
    :custom
    (lsp-ui-doc-position 'bottom)
    (lsp-ui-doc-show-with-cursor t)
    (lsp-ui-doc-delay 0.5)
    (lsp-ui-sideline-show-code-actions t)
    (lsp-ui-sideline-delay 0.5))

#+end_src

**** lsp-treemacs

Add treemacs lsp integration so that tree views can be displayed of more than just the project file structure.  For instance, symbols, references, and diagnostic messages.

#+begin_src emacs-lisp

  (use-package lsp-treemacs
    :after lsp)
  
#+end_src

**** lsp-ivy

Enhance searching codebase for things like usages of a symbol.

#+begin_src emacs-lisp

  (use-package lsp-ivy
    :after lsp)

#+end_src

**** yasnippet

Add YASnippet to enable snippet support in lsp-mode.

#+begin_src emacs-lisp

  (use-package yasnippet
    :after lsp
    :hook((prog-mode . yas-minor-mode)
  	(text-mode . yas-minor-mode))
    :config
    (yas-reload-all))

  (use-package yasnippet-snippets
    :after yasnippet)

#+end_src

*** Debugging with dap-mode

Sets up dap-mode for debugging and a key-binding for the dap-hydra pane for easier keybindings while debugging.  Currently only setup for the NodeJS debuging.

This can pick up =.vscode/launch.json= debugger configs in NodeJS projects, but can also be paired with a =debug.el= that has a ~dap-register-debug-template~.

#+begin_src emacs-lisp

  (use-package dap-mode
    ;; Uncomment the config below to hide all debug UI panes by default
    ;; :custom
    ;; (lsp-enable-dap-auto-configure nil)
    ;; :config
    ;; (dap-ui-mode 1)

    ;; Delay loading package until used
    :commands dap-debug

    :config
    ;; Bind `C-c l d` to `dap-hydra` for easy access
    (general-define-key
     :keymaps 'lsp-mode-map
     :prefix lsp-keymap-prefix
     "d" '(dap-hydra t :wk "debugger")))

#+end_src

*** Javascript

Adds javascript support and enables lsp features and dap-mode for js2-mode.

#+begin_src emacs-lisp

  (use-package js2-mode
    :mode "\\.js\\'"
    :hook (js2-mode . lsp-deferred)
    :config
    (setq js2-basic-offset 2)

    ;; Let LSP handle errors
    (setq js2-mode-show-parse-errors nil)
    (setq js2-mode-show-strict-warnings nil)

    (require 'dap-node)
    (dap-node-setup))

#+end_src

*** Typescript

Adds typescript support to emacs and enables lsp features and dap-mode for typescript-mode.

#+begin_src emacs-lisp

  (use-package typescript-mode
    :mode "\\.ts\\'"
    :hook (typescript-mode . lsp-deferred)
    :config
    (setq typescript-indent-level 2)
    (require 'dap-node)
    (dap-node-setup))

#+end_src

**** TODO Emacs 29+ has built-in =typescript-ts-mode=, so this can probably get eliminated for something built-in using treesitter.

*** Go

Add Go support to emacs and enables lsp features and dap-mode for go-mode.

#+begin_src emacs-lisp

  (use-package go-mode
    :mode "\\.go\\'"
    :hook ((go-mode . lsp-deferred)
  	 (before-save . gfmt-before-save))
    :config
    (setq gofmt-command "goimports")
    (require 'dap-go)
    (dap-go-setup))

#+end_src

