emacs-config.org
** Company Mode

Adds better code completion than the built-in =completion-at-point=.

#+begin_src emacs-lisp

  (use-package company
    :after lsp-mode
    :hook (lsp-mode . company-mode)
    :bind
    (:map company-active-map
    	("<tab>" . company-complete-selection))
    (:map lsp-mode-map
    	("<tab>" . company-indent-or-complete-common))
    :custom
    (company-minimum-prefix-length 1)
    (company-idle-delay 0.0)
    ;; Disable company-echo-metadata-frontend because the echo area refresh was jittery
    (company-frontends '(company-pseudo-tooltip-unless-just-one-frontend
  		       company-preview-frontend)))

  (use-package company-box
    :hook (company-mode . company-box-mode))

#+end_src

** Commenting

Better code commenting that adds the ability to comment one or multiple lines with using a keybinding.

#+begin_src emacs-lisp

  (use-package evil-nerd-commenter
    :bind ("M-/" . evilnc-comment-or-uncomment-lines))
  
#+end_src

** Projectile

Improve navigation of code projects.

#+begin_src emacs-lisp

  (use-package projectile
    :diminish projectile-mode
    :config
    (projectile-mode)
    (projectile-discover-projects-in-search-path)
    :custom ((projectile-completion-system 'ivy))
    :bind-keymap
    ("C-c p" . projectile-command-map)
    :init
    (when (file-directory-p "~/code/me")
      (setq projectile-project-search-path '("~/code/me")))
    (setq projectile-switch-project-action #'projectile-dired))

  (use-package counsel-projectile
    :after projectile
    :config (counsel-projectile-mode))

#+end_src

** Magit

Maybe the best git editor integration every.  Possibly the whole reason to use emacs at all.

#+begin_src emacs-lisp

  (use-package magit
    :commands magit-status
    :custom
    (magit-display-buffer-function #'magit-display-buffer-same-window-except-diff-v1))

  (lal/leader-keys
    "g" '(:ignore t :which-key "git")
    "gs" '(magit-status :which-key "magit status")
    "gb" '(magit-blame :which-key "magit blame"))

#+end_src

** Rainbow Delimiters

Make it easier to match opening and closing delimiters, especially in lisp ;-)

#+begin_src emacs-lisp

  (use-package rainbow-delimiters
    :hook (prog-mode . rainbow-delimiters-mode))

#+end_src

* Terminals

#+begin_src emacs-lisp

  ;; ===== TERMINALS =====

#+end_src

** term-mode

Term is built-in, so it won't get installed, but we can use ~use-package~ to configure it.

#+begin_src emacs-lisp

  (use-package term
    :commands term
    :config
    (setq explicit-shell-file-name "bash")
    ;;(setq explicit-zsh-args '())
    (setq term-prompt-regexp "^[^#$%>❱\n]*[#$%>❱] *"))

#+end_src

*** Better term-mode colors

#+begin_src emacs-lisp

  (use-package eterm-256color
    :hook (term-mode . eterm-256color-mode))
  
#+end_src

** vterm

vterm is a better terminal emulator than term.  It's a native compiled module, so it's a bit faster. It's the best option for heavy terminal users.

#+begin_src emacs-lisp

  (use-package vterm
    :commands vterm
    :config
    (setq term-prompt-regexp "^[^#$%>❱\n]*[#$%>❱] *")
    ;;(setq vterm-shell "zsh")
    (setq vterm-max-scrollback 10000))
  
#+end_src

** eshell

eshell is a shell implementation in emacs lisp.  It works cross-platform, which is handy for getting GNU utilities in Windows.

It does not run interactive programs that present themselves visually well (i.e. vim, top, less, etc), but most of those are already setup in ~eshell-visual-commands~, and will open in a new term buffer. It's also not great a piping, and other unix-y type things.

It is also an Emacs Lisp REPL, so it can evaluate emacs lisp expressions.  

You can also open the current directory in =dired= by running =dired .=.

You can also pipe the output of a command to a buffer with something like =COMMAND > #<buffer BUFFER_NAME>=.

#+begin_src emacs-lisp

  (defun lal/configure-eshell()
    ;; Save command history when commands are entered
    (add-hook 'eshell-pre-command-hook 'eshell-save-some-history)

    ;; Truncate buffer for performance
    (add-to-list 'eshell-output-filter-functions 'eshell-truncate-buffer)

    ;; Bind some useful keps for evil-mode
    (evil-define-key '(normal insert visual) eshell-mode-map (kbd "C-r") 'counsel-esh-history)
    (evil-define-key '(normal insert visual) eshell-mode-map (kbd "<home>") 'eshell-bol)
    (evil-normalize-keymaps)

    (setq eshell-history-size 10000
  	eshell-buffer-maximum-lines 10000
  	eshell-hist-ignoredups t
  	eshell-scroll-to-bottom-on-input 1))

  (use-package eshell-git-prompt
    :after eshell)

  (use-package eshell
    :hook (eshell-first-time-mode . lal/configure-eshell)
    :config

    (with-eval-after-load 'esh-opt
      (setq eshell-discover-buffer-when-process-dies t))
    
    (eshell-git-prompt-use-theme 'powerline))

#+end_src

* File Management

#+begin_src emacs-lisp

  ;; ===== FILE MGMT =====

#+end_src

** Dired

Dired is built-in. Using use-package to configure it, hence ~:ensure nil~.

#+begin_src emacs-lisp

  (use-package dired
    :ensure nil
    :commands (dired dired-jump)
    :bind (("C-x C-j" . dired-jump))
    :custom
    (dired-listing-switches "-alghoF")
    (dired-kill-when-opening-new-dired-buffer t)
    (delete-by-moving-to-trash t)
    :config
    (evil-collection-define-key 'normal 'dired-mode-map
      "h" 'dired-up-directory
      "l" 'dired-find-file))

  (use-package nerd-icons-dired
    :hook
    (dired-mode . nerd-icons-dired-mode))

#+end_src
