.emacs.d/init.el

(use-package company
  :after lsp-mode
  :hook (lsp-mode . company-mode)
  :bind
  (:map company-active-map
  	("<tab>" . company-complete-selection))
  (:map lsp-mode-map
  	("<tab>" . company-indent-or-complete-common))
  :custom
  (company-minimum-prefix-length 1)
  (company-idle-delay 0.0)
  ;; Disable company-echo-metadata-frontend because the echo area refresh was jittery
  (company-frontends '(company-pseudo-tooltip-unless-just-one-frontend
		       company-preview-frontend)))

(use-package company-box
  :hook (company-mode . company-box-mode))

(use-package evil-nerd-commenter
  :bind ("M-/" . evilnc-comment-or-uncomment-lines))

(use-package projectile
  :diminish projectile-mode
  :config
  (projectile-mode)
  (projectile-discover-projects-in-search-path)
  :custom ((projectile-completion-system 'ivy))
  :bind-keymap
  ("C-c p" . projectile-command-map)
  :init
  (when (file-directory-p "~/code/me")
    (setq projectile-project-search-path '("~/code/me")))
  (setq projectile-switch-project-action #'projectile-dired))

(use-package counsel-projectile
  :after projectile
  :config (counsel-projectile-mode))

(use-package magit
  :commands magit-status
  :custom
  (magit-display-buffer-function #'magit-display-buffer-same-window-except-diff-v1))

(lal/leader-keys
  "g" '(:ignore t :which-key "git")
  "gs" '(magit-status :which-key "magit status")
  "gb" '(magit-blame :which-key "magit blame"))

(use-package rainbow-delimiters
  :hook (prog-mode . rainbow-delimiters-mode))

;; ===== TERMINALS =====

(use-package term
  :commands term
  :config
  (setq explicit-shell-file-name "bash")
  ;;(setq explicit-zsh-args '())
  (setq term-prompt-regexp "^[^#$%>❱\n]*[#$%>❱] *"))

(use-package eterm-256color
  :hook (term-mode . eterm-256color-mode))

(use-package vterm
  :commands vterm
  :config
  (setq term-prompt-regexp "^[^#$%>❱\n]*[#$%>❱] *")
  ;;(setq vterm-shell "zsh")
  (setq vterm-max-scrollback 10000))

(defun lal/configure-eshell()
  ;; Save command history when commands are entered
  (add-hook 'eshell-pre-command-hook 'eshell-save-some-history)

  ;; Truncate buffer for performance
  (add-to-list 'eshell-output-filter-functions 'eshell-truncate-buffer)

  ;; Bind some useful keps for evil-mode
  (evil-define-key '(normal insert visual) eshell-mode-map (kbd "C-r") 'counsel-esh-history)
  (evil-define-key '(normal insert visual) eshell-mode-map (kbd "<home>") 'eshell-bol)
  (evil-normalize-keymaps)

  (setq eshell-history-size 10000
	eshell-buffer-maximum-lines 10000
	eshell-hist-ignoredups t
	eshell-scroll-to-bottom-on-input 1))

(use-package eshell-git-prompt
  :after eshell)

(use-package eshell
  :hook (eshell-first-time-mode . lal/configure-eshell)
  :config

  (with-eval-after-load 'esh-opt
    (setq eshell-discover-buffer-when-process-dies t))
  
  (eshell-git-prompt-use-theme 'powerline))

;; ===== FILE MGMT =====

(use-package dired
  :ensure nil
  :commands (dired dired-jump)
  :bind (("C-x C-j" . dired-jump))
  :custom
  (dired-listing-switches "-alghoF")
  (dired-kill-when-opening-new-dired-buffer t)
  (delete-by-moving-to-trash t)
  :config
  (evil-collection-define-key 'normal 'dired-mode-map
    "h" 'dired-up-directory
    "l" 'dired-find-file))

(use-package nerd-icons-dired
  :hook
  (dired-mode . nerd-icons-dired-mode))
